Ret640/bulk/LSkEps/mesh1/0.orig/alphat
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0.1";
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    bottom
    {
        type            compressible::alphatJayatillekeWallFunction;
        Prt             0.85;
        value           uniform 1e-20;
    }
    top
    {
        type            compressible::alphatJayatillekeWallFunction;
        Prt             0.85;
        value           uniform 1e-20;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
